Revit 2027 API
FillPatternElement.GetFillPatternElementByName Method
 Retrieves the FillPatternElement by its name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FillPatternElement GetFillPatternElementByName(
	Document document,
	FillPatternTarget target,
	string name
)
Public Shared Function GetFillPatternElementByName (
	document As Document,
	target As FillPatternTarget,
	name As String
) As FillPatternElement
public:
static FillPatternElement^ GetFillPatternElementByName(
	Document^ document,
	FillPatternTarget target,
	String^ name
)
static member GetFillPatternElementByName :
        document : Document *
        target : FillPatternTarget *
        name : string -> FillPatternElement
Parameters
document Document
 The document in which to retrieve the FillPatternElement.
target FillPatternTarget
 The FillPatternTarget of the FillPatternElement.
name String
 The name of the FillPatternElement.
Return Value
FillPatternElement
 The FillPatternElement.
Exceptions
Exception | Condition
ArgumentException |  target must be Model or Drafting.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FillPatternElement Class
Autodesk.Revit.DB Namespace